app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("content", "header", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "asdasdasdasd"], ["header", "newenwjewea';l"], ["created_at", "2015-08-11 22:41:43.108688"], ["updated_at", "2015-08-11 22:41:43.108688"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 980190962]]
---
  def update
    @post = Post.find(params[:id])

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 980190962]]
---
  def destroy
    @post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_post
      @post = Post.find(params[:id])