app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "strinaag@string.test"]]
---
  def create
    user = User.find_by_email(session_params[:email])