app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all

INSERT INTO "users" ("email", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "test@test.test"], ["name", "BOB"], ["created_at", "2015-08-08 11:45:14.430733"], ["updated_at", "2015-08-08 11:45:14.430733"]]
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 980190962]]
UPDATE "users" SET "salt" = ?, "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["salt", "a87c41197386c5264889cd0e5d3a9a3ea3d8b85227a7891756fa222600c5f3a0"], ["name", "NOT BOB"], ["updated_at", "2015-08-08 12:51:16.325797"], ["id", 980190962]]
---
  def update
    @user = User.find(params[:id])

    if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]
---
  def destroy
    @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_user
      @user = User.find(params[:id])